app/controllers/cardapios_controller.rb

SELECT "cardapios".* FROM "cardapios"
---
  def index
    @cardapios = Cardapio.all

INSERT INTO "cardapios" ("nome", "descricao", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Alface"], ["descricao", "alface, tomate"], ["preco", 10.0], ["created_at", "2016-05-16 23:30:42.147748"], ["updated_at", "2016-05-16 23:30:42.147748"]]
---
  def create
    @cardapio = Cardapio.new(cardapio_params)

    respond_to do |format|
      if @cardapio.save

UPDATE "cardapios" SET "nome" = ?, "descricao" = ?, "preco" = ?, "updated_at" = ? WHERE "cardapios"."id" = ?  [["nome", "Salada"], ["descricao", "Alface, tomate"], ["preco", 10.0], ["updated_at", "2016-05-05 20:51:45.430961"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cardapio.update(cardapio_params)

DELETE FROM "cardapios" WHERE "cardapios"."id" = ?  [["id", 1]]
---
  def destroy
    @cardapio.destroy

SELECT  "cardapios".* FROM "cardapios" WHERE "cardapios"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cardapio
      @cardapio = Cardapio.find(params[:id])