app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("nome", "cpf", "endereco", "numero", "cidade", "estado", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "nome" = ?, "cpf" = ?, "endereco" = ?, "numero" = ?, "cidade" = ?, "estado" = ?, "email" = ?, "updated_at" = ? WHERE "clientes"."id" = ?

  def destroy
    @cliente.destroy
---
DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 1]]