app/controllers/entregas_controller.rb

  def index
    @entregas = Entrega.all
---
SELECT "entregas".* FROM "entregas"

  def create
    @entrega = Entrega.new(entrega_params)

    respond_to do |format|
      if @entrega.save
---
INSERT INTO "entregas" ("data", "situacao", "Pedido_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["data", "20/10/00"], ["situacao", "encerrado"], ["Pedido_id", 1], ["created_at", "2016-05-10 01:27:29.843329"], ["updated_at", "2016-05-10 01:27:29.843329"]]

  def update
    respond_to do |format|
      if @entrega.update(entrega_params)
---
UPDATE "entregas" SET "situacao" = ?, "updated_at" = ? WHERE "entregas"."id" = ?  [["situacao", "caminho"], ["updated_at", "2016-05-10 01:27:51.631495"], ["id", 1]]

    def set_entrega
      @entrega = Entrega.find(params[:id])
---
SELECT  "entregas".* FROM "entregas" WHERE "entregas"."id" = ? LIMIT 1  [["id", 1]]