app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos"
---
  def index
    @pedidos = Pedido.all

INSERT INTO "pedidos" ("situacao", "cliente_id", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["situacao", "aguardando"], ["cliente_id", 1], ["data", "2016-05-05"], ["created_at", "2016-05-05 20:06:03.664893"], ["updated_at", "2016-05-05 20:06:03.664893"]]
---
  def create
    @pedido = Pedido.new(pedido_params)

    respond_to do |format|
      if @pedido.save

UPDATE "pedidos" SET "situacao" = ?, "cliente_id" = ?, "updated_at" = ? WHERE "pedidos"."id" = ?  [["situacao", ""], ["cliente_id", nil], ["updated_at", "2016-05-05 20:06:41.211845"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @pedido.update(pedido_params)

DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 1]]
---
  def destroy
    @pedido.destroy

SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pedido
      @pedido = Pedido.find(params[:id])